# # Второй урок это условия if elif else 
# # opertory  and , or ,

# n = int(input("Ввидите первое число "))
# op = int(input("""
# 1:+
# 2:-
# 3:*
# 4:/

# >>> """))
# n2 = int(input("Ввидите второе  число "))

# if op == 1:
#     rez = n + n2
#     print(f"{n} + {n2} = {rez}")

# if op == 2:
#     rez = n - n2
#     print(f"{n} - {n2} = {rez}")

# if op == 3:
#     rez = n * n2
#     print(f"{n} * {n2} = {rez}") 

# if op == 4:
#     if n2 == 0:
#         print("на ноль делить нельзя")
#     else:    
#         rez = n / n2
#         print(f"{n} / {n2} = {rez}")   
# else:
#     print("такой команды нету")


                                                # первое Задания 
# n1 = 2**3
# n2 = 3**2

# if n1 > n2:
#     print(f'первое число больше {n1} чем второе число {n2} ')

# else:
#     print(f'второе число {n2} больше  чем первое число {n1} ')

                                                # ЗАДАНИЕ НОМЕР 2

# n=int(input("Введите число:")) 
 
# if n>100 or 21<n<57: 
#     print("Введите другое число") 
# else: 
#     print("Правильный номер")

                                                # ЗАДАНИЕ НОМЕР 3


# print(f'напишите число ')

# a = int(input())


# if a % 2 == 0:
#     print("Это у вас четное число ")
# else:
#     print("Число у вас нечетное ")

# if a % 3 == 0:
#     print("Это число делится на 3 без остаток")
# else:
#     print("имеется остаток")

# if a**2 > 1000:
#     print('это число больше 1000')
# else:
#     print("число меньше 1000")


                                                    # ЗАДАНИЕ НОМЕР 4

# if True:
#     print('Hello')

                                                     # ЗАДАНИЕ НОМЕР 5

# a = 10 // 5 

# b = 10 / 5 

# if a == b:
#     print("есть контакт ")
# else:
#     print("нету контакта")

                                                     # ЗАДАНИЕ НОМЕР 6


# a = int(input())
# if a > 0:
#     print("число положительное")

# else:
#     print("число отрицательное")

                                                    # ЗАДАНИЕ НОМЕР 7

# a = 10

# b = 5

# if a and b > 0:
#     print("положительные числа")

# else:
#     print("отрицательные числа ")
                                                     # ЗАДАНИЕ НОМЕР 8

# a = 10

# b = 5

# if a > b:
#     rez = a + 2
#     print(f"{a} + {2} = {rez}")


                                                     # ЗАДАНИЕ НОМЕР 9

