# Задание №3': """
#             1 Практика методов ключ значение
#             Написать скрипт который проходится по ключам и проверяет значения
#             a) Если значение делиться на 3, то записываем строку “Hi”
#             b) Если значение делиться на 5, то записываем строку “Bye”
#             ПРИМЕР:
#             Дано -> dict1 = {'a': 5, 'b': 3, 'c': 10, 'd': 15, 'e': 20, 'f':30, 'g': 42, 'h': 50}
#             Результат -> a = Bye
#             b = Hi""",



# dict1 = {'a': 5, 'b': 3, 'c': 10, 'd': 15, 'e': 20, 'f':30, 'g': 42, 'h': 50}


# for key, value in dict1.items():
#     if value % 3 == 0:
#         print(f"{key} = Hi")
#     if value % 5 == 0:
#         print(f"{key} = Bye")
#     if value % 3 == 0 and value % 5 == 0:
#         print(f"{key} = Hi Bye")



#_________________________________________________________________________________________________________________________
            
# Задача 4
# total = 0

# for i in range(1000):
#     if i % 3 == 0 or i % 5 ==0:
#         total = i 

#         print(total)
#_______________________________________________________________________________________________________________________
#
#   'Задание №5': """
#             Если взять строку - "237" и сложить все её числа то получится 2+3+7 = 12.
#             Возьмите строку "4729461084" и сложите все её числа.
#             Результат выведите на экран.""",

# a = '4729461084'
# t = 0
# for line in a:
#     num = int(line)
#     t += num
#     print(t)

#__________________________________________________________________________________________________________
#  
#   'Задание №6': """
    #         Создайте input() который принимает от пользователя 
    #         дату в формате: "2020-10-24 18:30" и возвращает dictionary 
    #         разделённую по значениям даты:

    #         date = {
    #         "year": "2020",
    #         "month": "10",
    #         .....
    #         }""",


# a = input("Введите дату в формате '2020-10-24 18:30': ")
# num = a.split('-') + a.split(' ')[1].split(':')
# date = {
#     "год": num[0],
#     "месяц": num[1],
#     "день": num[2],
#     "час": num[3],
#     "мин": num[4]}
# print(date)
#______________________________________________________________________________________________________________________
#

#                                         Первое задания 

#a=int(input("Введите число: "))
# b=int(input("Введите второе число: "))
# op= int(input("Какую операцию выполнить: 1. +  2.-  3.*  4./: "))

# if op==1:
#     rez=a+b
#     print(f' {a} + {b}= {rez}')
# elif op==2:
#     rez=a-b
#     print(f'{a}+{b}={rez}')
# elif op==3:
#     rez=a*b
#     print(f'{a}*{b}={rez}')
# elif op==4:
#     if b==0:
#         print('Error')
#     else:
#         rez=a/b
#         print(f'{a}/{b}={rez}')
#________________________________________________________________________________________________________________________

# 'Задание №7': """
#  Напишите проверку на то, является ли строка палиндромом.
# Палиндром — это слово или фраза, которые одинаково читаются слева направо и справа налево.            
# # Пример:
#  # тот -> тот
# # потоп -> потоп
#  # көк -> көк
# # СЛОВА ДЛЯ ПРОВЕРКИ:  words = ['Anna', 'civic', 'kayak', 'Level', 'Madam', 'Mom', 'Noon', 'Racecar', 'Radar', 'еще', 'кабак', 'шалаш', 'лишил','language', 'which', 'means', 'vendor', 'слова', 'фраза', 'введите', 'слово', 'кнопку',]

